#리스트

a = [1, 2, 3, 4, 5]
a[0] #1

b = [ [1, 2] ]
b[0] #[1, 2]
print(b[0])
print(b[0][0])

c = [
     [1,2], 
     [3,4] 
    ]
#2차원리스트[행][열]
#행열
#여러개의 1차원리스트가 들어있는 리스트

scores = [
            [60, 80, 70],
            [20, 82, 90],
            [76, 77, 88]
        ]
scores[2][1]


d = [ [ [1,2] ] ]
print(d[0][0][0])
#3차원리스트[층][행][열]
#텐서
#여러개의 2차원리스트가 들어있는 리스트

tensor = [ 
          [ 
            [1, 2],
            [3, 4]
          ],
          [
            [5, 6],
            [7, 8]
          ]
         ]
print(tensor[0][0][0])
print(tensor[1][1][0])





#------------------------------------------------------------
import numpy as np
arr = np.array(tensor)
print(arr)



